/******************************************************************************
Copyright 2005 大连易达通电子有限公司
All rights riserved.

文件名  ：main.h
模块名称：定义了所有的数据类型

当前版本：0.0.1
修改人	：许岩
完成日期：2005.04.06
升级说明：create
******************************************************************************/
#ifndef __MAIN_H__
#define __MAIN_H__


//全局条件编译控制
//#define EN_WDT
//#define TEST_CARD


#include <data_type.h>

#include <string.h>
#include <stdlib.h>
#include <stdio.h>

#include "macrodef.h"
#include "common_exp.h"
#include "CommonFunc.h"
#include "printer.h"
#include "IODrive.h"
#include "ffile.h"
#include "cfile.h"
#include "tms.h"


#include "ydt.h"
#include "shell.h"
#include "ymodem.h"








#define 	ok			        	(0)
#define     notok                   (0xFF)
#define 	LOW						(0)
#define 	HIGH		       		(1)
#define 	ON			        	(0)
#define 	OFF		        		(1)
#define		FORWARD					(0)
#define		BACKWARD				(1)

#define		RECNUM_OF_BACKUP_FILE	(10000)

#define		MAX_OPERATOR_NUM		(1000)
#define		MAX_LINE_NUM			(100)
#define		MAX_STATION_NUM			(50)
//#define		MAX_OPERATOR_NUM		(10)
//#define		MAX_LINE_NUM			(3)
//#define		MAX_STATION_NUM			(12)


//卡类型
#define		CARDT_YOUHUI			(0x01)		//优惠卡
#define		CARDT_YUEPIAO			(0x02)		//月票卡


//设备状态，最重要的变量，如果增加变量，请在SysInit里进行初始化
typedef struct _DEV_STAT
{

	INT8U start;

	INT16U format_sign;						//格式化标志，=0x55AA说明格式化过
//  INT32U line_amount;						//存储的线路数量

	INT8U pos_number[7];					//机器号 6
	INT8U bus_number[10];					//当前车号,5位 12345
	//当前线路信息
	INT16U line_ptr;						//线路指针
	INT8U line_number[6];					//线路号@406
	INT8U line_menu_name[22];				//菜单选择中的线路名
	INT8U line_full_name[41];				//线路全名
	INT16U banci;							//班次

	INT16U crc;                             //参数的CRC校验码
	INT8U zhekou;						   //存储的优惠卡折扣数值10-100. 乘以10之后的保存
	INT8U end;


	INT8U err_occured;						// == TRUE出错 ＝＝FALSE设备正常
	INT16U err_code;						//出错代码

	INT8U cmd_rcvd;							//是否收到通讯数据
//  INT16U rcv_len;							//串口收到数据长度

	//当前站点信息
	INT8U direction;						//行驶方向，正向=FORWARD 反向=BACKWARD
	INT8U last_direction;					//上次行驶方向
	INT16U last_start_station;				//上次发车站
	INT16U last_end_station;				//上次到站

	INT8U bus_number_full[10];				//当前车号全名,鲁P-12345

	//当前员工信息
	INT16U op_ptr;							//员工指针
	INT8U op_number[5];						//工号，4个数字
	INT8U op_name[11];						//员工姓名

	INT16U start_station;					//上车站点
	INT16U end_station;						//下车站点
	INT8U start_station_number[5];			//上车站点编号,4字节ascii
	INT8U start_station_name[22];			//上车站点名
	INT8U end_station_number[5];			//下车站点编号,4字节ascii
	INT8U end_station_name[22];				//下车站点名
	//票价信息
	INT8U origin_prices[22];				//原始票价，ASCII码方式
	FP64 origin_pricef;						//原始票价
	INT32U origin_price;					//原始票价，单位分
	INT32U half_price;						//半价票价，单位分
	FP32 package_pricef;					//行包票价
	INT32U package_price;					//行包票价，单位分
	INT8U half_discount;					//是否为半价 TRUE=半价 FALSE=全价
	INT8U ticket_type;						//票的种类 全票="1" 半票="2" 货票="3" 废票="4"  优惠卡="5"  月票卡="7"  统计用票="6"
	INT16U ticket_amount;					//购票张数
	INT8U prices[8];						//生成记录用票价，ASCII码方式

	BUS_TIME sell_ticket_time;				//售票时间
	INT8U sell_ticket_times[15];			//售票时间，ascii

//  INT8U ticket_number[8];					//当前票号 7字节ascii
//  INT8U ticket_number_start[8];			//起始票号 7字节ascii
//  INT8U ticket_number_end[8];				//终止票号 7字节ascii

	INT32U cur_ticket_number;				//当前票号

	//parm文件中读出
	INT8U version[100];						//参数版本号
	INT32S operator_amount;					//操作员数量
	INT32S line_amount;						//线路数量

	INT32U iccard_price;					//刷卡票价，单位分
	INT32U record_number;					//未上传记录数
}DEV_STAT;



typedef struct _OPERATOR_INFO
{
	INT8U number[5];					//工号，4个数字
	INT8U name[11];						//员工姓名
	INT8U passwd[11];					//密码，最长10个数字
}OPERATOR_INFO;

typedef struct _LINE_INFO
{
	INT8U number[6];					//线路号@406，@+4个数字
	INT8U menu_name[22];				//菜单显示名称
	INT8U full_name[41];				//线路全名
}LINE_INFO;

typedef struct _STATION_INFO
{
//  INT16U forward_station_num;											//上行站点数量
//  INT16U backward_station_num;										//下行站点数量
	INT32S forward_station_num;											//上行站点数量
	INT32S backward_station_num;										//下行站点数量
	INT8U forward_number[MAX_STATION_NUM][5];							//上行站点编号,4字节ascii
	INT8U backward_number[MAX_STATION_NUM][5];							//下行站点编号,4字节ascii
	INT8U forward_name[MAX_STATION_NUM][15];							//上行站名,7汉字
	INT8U backward_name[MAX_STATION_NUM][15];							//下行站名,7汉字
	INT8U forward_price_table[MAX_STATION_NUM][MAX_STATION_NUM][7];		//上行票价表ASCII码储存,最大9999.9
	INT8U backward_price_table[MAX_STATION_NUM][MAX_STATION_NUM][7];	//下行票价表ASCII码储存,最大9999.9
}STATION_INFO;


//typedef struct _TICKET_INFO
//{
//	INT8U pos_number[7];		//机器号 6
//	INT8U ticket_number[8];		//票号 7
//	INT8U ticket_time[15];		//收费日期时间	14
//	INT8U op_number[5];			//收费员号	6
//	INT8U start_station_num[5];	//起始站编号 4
//	INT8U start_station_name[15];//起始站   14
//	INT8U end_station_num[5];	//到达站编号 3
//	INT8U end_station_name[15];	//到达站  14
//	INT8U price_type[2];		//价格类型(全票、半票、货票、废票) 1  全票="1" 半票="2" 货票="3" 废票="4"
//	INT8U price[8];				//收费金额 7
//	INT8U bus_number[10];		//车号 9 "鲁P-12345"
//	INT8U banci[3];				//班次 2
//	INT8U direction[2];			//方向 1 上行="1" 下行="2"
//	INT8U line_number[6];		//线路号 5 "@406"，@+4个数字
//}TICKET_INFO;					//一共106个字节
typedef struct _TICKET_INFO
{
	INT8U pos_number[7];		//机器号 6
	INT8U ticket_number[8];		//票号 7
	INT8U ticket_time[15];		//收费日期时间	14
	INT8U op_number[5];			//收费员号	6
	INT8U start_station_num[5];	//起始站编号 4
	INT8U start_station_name[15];//起始站   14
	INT8U end_station_num[5];	//到达站编号 3	
	INT8U end_station_name[15];	//到达站  14
	INT8U price_type[2];		//价格类型(全票、半票、货票、废票) 1  全票="1" 半票="2" 货票="3" 废票="4"
	INT8U price[8];				//收费金额 7
	INT8U bus_number[10];		//车号 9 "鲁P-12345"
	INT8U banci[3];				//班次 2
	INT8U direction[2];			//方向 1 上行="1" 下行="2"
	INT8U line_number[6];		//线路号 5 "@406"，@+4个数字
	INT8U trade_type[3];		//交易类型 2 "00"代表现金、"06"代表优惠卡交易、"07"代表月票卡交易、"11"代表黑名单交易
	INT8U card_number[9];		//刷卡卡号 8 "00000001"
	INT8U card_balance[9];		//卡余额(单位分) 8 "10000"=100元 最大到999999.99元
}TICKET_INFO;					//一共个字节

typedef struct _TODAY_SUM
{
	INT32S full_num;        //全价票张数
	INT32S full_sum;        //全价票总额 单位分
	INT32S half_num;        //半价票张数
	INT32S half_sum;        //半价票总额 单位分
	INT32S package_num;     //货票张数
	INT32S package_sum;     //货票总额   单位分
	INT32S valid_num;       //废票张数
	INT32S valid_sum;       //废票总额   单位分
	INT32S youhui_num;      //优惠卡张数
	INT32S youhui_sum;      //优惠卡总额 单位分
	INT32S yuepiao_num;      //月票卡张数
	INT32S yuepiao_sum;      //月票卡总额 单位分
	INT32S total_num;       //总张数
	INT32S total_sum;       //总额
	INT8U  banci;
	INT8U  day_or_banci;
	INT8U  query_times[15];
}TODAY_SUM;







#define resetpos() (*(void(*)())0)()

#define OS_ENTER_CRITICAL()	
#define OS_EXIT_CRITICAL()





/*****************************************************************
 函数原型：	param_init()
 功能描述：参数等初始化
 参数描述：	
				 
 返回值：	无
 
 作  者：	许岩
 日  期：	2004-09-17
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
*****************************************************************/
void param_init(void);



/*****************************************************************
 函数原型：system_check()
 功能描述：系统自检以及gprs模块参数配置
 参数描述：	
				 
 返回值：	无
 
 作  者：	许岩
 日  期：	2004-09-17
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
*****************************************************************/
void system_check(void);



/******************************************************************************
 函数名称：TimeFormatChk
 功能描述：读时钟，看时钟格式是否正确
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-自检成功
				 notok(0xFF)-自检失败
				   
 作      者	：许岩
 日      期：2004-09-02
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U TimeFormatChk (void);



/******************************************************************************
 函数名称：TimeModify
 功能描述：要求输入时间，进行修改
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2004-09-02
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void TimeModify(void);



void printer_test(void);



/******************************************************************************
 函数名称：operator_login
 功能描述：员工登录
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void operator_login(void);



/******************************************************************************
 函数名称：line_number_verify
 功能描述：核对线路号
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void line_number_verify(void);



/******************************************************************************
 函数名称：bus_number_verify
 功能描述：核对车号
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void bus_number_verify(void);



/******************************************************************************
 函数名称：choose_line
 功能描述：选择线路
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void choose_line(void);



/******************************************************************************
 函数名称：sell_ticket
 功能描述：售票流程
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void sell_ticket(void);



/******************************************************************************
 函数名称：choose_start_station
 功能描述：选择上车站点
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
				 notok(0xFF)-按取消键了
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U choose_start_station(void);



/******************************************************************************
 函数名称：choose_end_station
 功能描述：选择下车站点
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
				 notok(0xFF)-按取消键了
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U choose_end_station(void);



/******************************************************************************
 函数名称：msystem
 功能描述：菜单->系统设置
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void msystem(void);



/******************************************************************************
 函数名称：set_banci
 功能描述：设置班次
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void set_banci(void);



/******************************************************************************
 函数名称：set_pos_number
 功能描述：设置POS号
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void set_pos_number(void);


/******************************************************************************
 函数名称：set_youhui_zhekou
 功能描述：设置优惠卡折扣
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：刘及华
 日      期：2014-10-19
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void set_youhui_zhekou(void);

/******************************************************************************
 函数名称：set_pos_init
 功能描述：初始化POS机
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void set_pos_init(void);



/******************************************************************************
 函数名称：generate_ticket_info
 功能描述：生成票价记录
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void generate_ticket_info(void);



/******************************************************************************
 函数名称：set_ticket_number
 功能描述：设置票号
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void set_ticket_number(void);



/******************************************************************************
 函数名称：print_ticket
 功能描述：根据记录打票 
 参数名称：	输入/输出？	类型		描述
 ticket		输入		TICKET_INFO *	车票的记录
 
 返  回  值：无
 
 作      者：许岩
 日      期：2012-10-29
 修改历史：
	日期		修改人		修改描述
	------		---------	-------------
******************************************************************************/
void print_ticket(TICKET_INFO *ticket);



/******************************************************************************
 函数名称：query_capacity
 功能描述：查询记录空间
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void query_capacity(void);


/******************************************************************************
 函数名称：query_today_summary
 功能描述：查询今日汇总
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void query_today_summary(void);
/******************************************************************************
 函数名称：print_summary
 功能描述：打印统计数据
 参数名称：	输入/输出？	类型		描述
 pSummary		输入		TODAY_SUM *	统计的数据，包含今日全天，和每个班次的
 ticket     	输入     	车载数据信息
 返  回  值：无
 
 作      者：许岩/刘及华
 日      期：2012-12-02
 修改历史：
	日期		修改人		修改描述
	------		---------	-------------
******************************************************************************/
void print_summary(TODAY_SUM *pSummary);

/******************************************************************************
 函数名称：mdata
 功能描述：菜单->数据处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void mdata(void);



/******************************************************************************
 函数名称：invalid_ticket_process
 功能描述：废票处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void invalid_ticket_process(void);



/******************************************************************************
 函数名称：send_record_process
 功能描述：上传售票记录处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void send_record_process(void);



/******************************************************************************
 函数名称：generate_record_file
 功能描述：生成记录文件
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void generate_record_file(void);



/*****************************************************************
 函数原型：read_param_table()
 功能描述：读取参数表
 参数描述：	
				 
 返回值：	无
 
 作  者：	许岩
 日  期：	2004-09-17
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
*****************************************************************/
void read_param_table(void);



/******************************************************************************
 函数名称：send_backup_record_process
 功能描述：上传备份售票记录处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void send_backup_record_process(void);



/******************************************************************************
 函数名称：generate_backup_record_file
 功能描述：生成备份记录文件
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void generate_backup_record_file(void);



/******************************************************************************
 函数名称：format_process
 功能描述：格式化处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void format_process(void);
/******************************************************************************
 函数名称：void generate_summary_info(TODAY_SUM *pbill);
 功能描述：生成统计票数信息记录
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：无
				   
 作      者	：许岩/刘及华
 日      期：2012-12-3
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void generate_summary_info(TODAY_SUM *pbill);



/******************************************************************************
 函数名称：ic_card_process
 功能描述：刷卡处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
			 notok(0xFF)-按取消键了
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U ic_card_process(void);
/******************************************************************************
 函数名称：ic_yuepiaocard_process
 功能描述：月票卡刷卡处理
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
			 notok(0xFF)-按取消键了
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U ic_yuepiaocard_process(void);

/******************************************************************************
 函数名称：card_youhui_process
 功能描述：优惠卡处理流程
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
			 notok(0xFF)-失败
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U card_youhui_process(void);



/******************************************************************************
 函数名称：card_yuepiao_process
 功能描述：月票卡处理流程
 参数描述：
 参数名称：	输入/输出？	类型		描述
				
 返  回  值：ok(0)-成功
			 notok(0xFF)-失败
				   
 作      者	：许岩
 日      期：2012-10-30
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U card_yuepiao_process(void);



/******************************************************************************
 函数名称：Cal_Interval_Sec
 功能描述：计算刷卡间隔时间
 参数描述：
 参数名称：	输入/输出？	类型		描述
 interval	输入		INT32U		秒
 
 返  回  值：ok - 已经超过时间限制,允许继续刷卡
				notok - 不允许继续刷卡
   
 作      者	：许岩
 日      期：2006.1.9
 修改历史：
		日期		修改人		修改描述

******************************************************************************/
INT8U Cal_Interval_Sec(INT32U interval);




#endif
