/******************************************************************************
Copyright 2010 大连易达通电子有限公司
All rights riserved.

文件名  ：shell.h
模块名称：com1通讯任务 人机界面

当前版本：0.0.1
修改人	：许岩
完成日期：2005.04.06
升级说明：create
******************************************************************************/
#ifndef __SHELL_H__
#define __SHELL_H__

#include "data_type.h"


#define UART1_SEND_QUEUE_LENGTH	1200
#define UART1_RCV_QUEUE_LENGTH	1200



/******************************************************************************
 函数名称：communication
 功能描述：com1通讯任务
 参数描述：
 参数名称： 输入/输出？ 类型		描述
				
 返  回  值：无
				   
 作 	 者：许岩
 日 	 期：2010-06-18
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void communication(void);



/******************************************************************************
 函数名称：CommandAnalys
 功能描述：命令解析函数
 参数描述：
 参数名称： 输入/输出？ 类型		描述
 Buf			输入			INT8S *		接收到的字符串（要进行命令解析的字符串）
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2005-04-25
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U CommandAnalys(INT8S *Buf);



/******************************************************************************
 函数名称：armputs
 功能描述：串口1输出函数
 参数描述：
 参数名称： 输入/输出？ 类型		描述
 snd_buf	输入			void *		要发送的字符串
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2005-04-07
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void armputs(const void * snd_buf);



/******************************************************************************
 函数名称：arm_send_hex
 功能描述：串口1发送函数
 参数描述：
 参数名称： 输入/输出？ 类型		描述
 str_to_send	输入	INT8U *		要发送的字符串
 len			输入	INT32U		长度
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2005-04-07
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void arm_send_hex(INT8U * str_to_send, INT32U len);



/******************************************************************************
 函数名称：armputch
 功能描述：串口1输出函数
 参数描述：
 参数名称： 输入/输出？ 类型		描述
 ch			输入		INT8S		要发送的字节
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2005-04-07
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
void armputch(INT8S ch);



/******************************************************************************
 函数名称：InitCommands
 功能描述：命令初始化
 参数描述：
 参数名称： 输入/输出？ 类型		描述
				
 返  回  值：无
				   
 作 	 者 ：许岩
 日 	 期：2005-04-07
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
******************************************************************************/
INT8U InitCommands(void);



/******************************************************************************
 函数名称：HelpFunc
 功能描述：显示帮助
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U HelpFunc(INT8U argc1, INT8S **argv1);



INT8U HelloFunc(INT8U argc1,INT8S **argv1);



/*****************************************************************
函数原型：armgetch
功能描述：串口1接收
参数描述：
参数名称：	输入/输出？	类型		描述
-----------		-----------	------	   	-------

返  回  值：串口得到的数
作      者：许岩
日      期：2005-08-20
修改历史：
日期		修改人		修改描述
------		---------	-------------
*****************************************************************/
INT8U armgetch(void);



/******************************************************************************
 函数名称：dir_func
 功能描述：显示文件信息
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U dir_func(INT8U argc1, INT8S **argv1);



/******************************************************************************
 函数名称：fget_func
 功能描述：取文件命令
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U fget_func(INT8U argc1, INT8S **argv1);



/*******************************************************************************
  * @函数名称    UpdateCRC16
  * @函数说明   更新输入数据的CRC校验
  * @输入参数   crcIn
				byte
  * @输出参数   无
  * @返回参数   CRC校验值
*******************************************************************************/
uint16 UpdateCRC16(uint16 crcIn, uint8 byte);



/*******************************************************************************
  * @函数名称    UpdateCRC16
  * @函数说明   更新输入数据的CRC校验
  * @输入参数   data ：数据
				size ：长度
  * @输出参数   无
  * @返回参数   CRC校验值
*******************************************************************************/
uint16 Cal_CRC16(const uint8 *data, uint32 size);



/******************************************************************************
 函数名称：fput_func
 功能描述：放文件命令
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U fput_func(INT8U argc1, INT8S **argv1);



/*****************************************************************
函数原型：armgetch2
功能描述：串口1接收
参数描述：
参数名称：		输入/输出？	类型		描述
-----------		-----------	------	   	------- 
 timeout_ms		输入		INT32U		超时，单位毫秒
 ch				输出		INT8U *		得到的数

返  回  值：ok(0) - 成功 
			-1 - 按取消键了 
			-2 - 超时
作      者：许岩
日      期：2005-08-20
修改历史：
日期		修改人		修改描述
------		---------	-------------
*****************************************************************/
INT8S armgetch2(INT32U timeout_ms, INT8U *ch);



/*****************************************************************
 函数原型：test_crc16
 功能描述：判断一包数据的crc是否正确
 参数描述：
 参数名称：	输入/输出？	类型		描述
 data_to_cal_crc	输入	INT8U const *		要进行CRC计算的数组的起始指针
 len				输入	INT32U				要进行CRC计算的数组的长度

 返  回  值：ok(0) - 成功
			notok(0xff) - 失败
 作      者	：许岩
 日      期：2004-02-04
 修改历史：
		日期		修改人		修改描述
		------		---------	-------------
*****************************************************************/
INT8U test_crc16(INT8U const *data_to_cal_crc, INT32U len);



/*****************************************************************
函数原型：armgetch3
功能描述：串口1接收
参数描述：
参数名称：	输入/输出？	类型		描述
-----------		-----------	------	   	-------

返  回  值：串口得到的数
作      者：许岩
日      期：2005-08-20
修改历史：
日期		修改人		修改描述
------		---------	-------------
*****************************************************************/
INT8U armgetch3(void);



/******************************************************************************
 函数名称：del_func
 功能描述：删除文件命令
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U del_func(INT8U argc1, INT8S **argv1);



/******************************************************************************
 函数名称：crf_func
 功能描述：清除记录文件命令
 参数名称： 输入/输出？ 类型        描述
 argc1		输入		INT8U 		参数数量
 argv1		输入		INT8S**		指向参数的指针

 返  回  值：ok(0)-成功
				 notok(0xFF)-失败

 作      者 ：许岩
 日      期：2005-05-08
 修改历史：
		日期        修改人      修改描述
		------      ---------   -------------
******************************************************************************/
INT8U crf_func(INT8U argc1, INT8S **argv1);



















#endif

